app/views/kegs/show.erb

<ul>
<% @keg.keg_floors.each do |keg_floor|%>
---
SELECT "keg_floors".* FROM "keg_floors" WHERE "keg_floors"."keg_id" = ?  [["keg_id", 7]]