app/controllers/kegs_controller.rb

SELECT "kegs".* FROM "kegs"
---
    def index
        @kegs = Keg.all

SELECT "kegs".* FROM "kegs" WHERE "kegs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show
        @keg = Keg.find(params[:id])