app/controllers/users_controller.rb

INSERT INTO "users" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fg"], ["bio", "420"], ["created_at", "2019-12-03 20:59:45.464106"], ["updated_at", "2019-12-03 20:59:45.464106"]]
---
  def create
    @user = User.create(user_params)